frontend_old/controllers/RiskController.php

INSERT INTO `risk` (`department_id`, `date_report`, `time_report`, `duration_id`, `location_id`, `user_ir_type`, `user_ir`, `program_id`, `riskstore_id`, `level_id`, `detail`, `inform_id`, `affected`, `edit`, `problem_basic`, `image`, `create_date`, `modify_date`, `created_by`, `updated_by`) VALUES ('7', '2023-12-21', '21:24:00', 2, 23, '2', 4, 6, 352, 'B', 'เวลา21.29 น. ผู้ป่วยHN 660002260 เจ้าหน้าที่ห้องฉุกเฉินส่งผู้ป่วยมาเอกซเรย์ แต่ไม่นำใบvisitมายื่น และ แพทย์เวรห้องฉุกเฉินไม่สั่งรายการเอกซเรย์ในระบบ ทำให้เจ้าหน้าที่เอกซเรย์ต้องโทรไปถามข้อมูลผู้ป่วย', 8, 'ผู้ป่วย', 'ได้', 'โทรไปสอบถามชื่อผู้ป่วย HN และรายการเอกซเรย์', '', NOW(), NOW(), 253, 253)
---
    public function actionCreate()
    {
        $model = new Risk();

        $cid_r= Yii::$app->user->identity->cid;
        $sql = Yii::$app->db->createCommand("SELECT department_id1 FROM member  WHERE cid='$cid_r'")->queryOne();
        $dep_id =  $sql['department_id1'];

        $model->department_id = $dep_id;

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
        //if ($model->load(Yii::$app->request->post()) && $model->save()) {
            $model->image = $model->uploadMultiple($model,'image');
            $model->save();

SELECT * FROM `riskstore` WHERE `riskstore_id`='352'
SELECT * FROM `level` WHERE `level_code` IN ('A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I')
---
    public function actionGetLevelGroups() {
        $level_codes = [];
        $riskstore =  Riskstore::findOne($_GET['riskstore_id']);
        switch ($riskstore->type_id) {
            case 1:
                $level_codes = ['1', '2', '3', '4', '5'];
                break;
            case 2:
                $level_codes = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'];
                break;
        }
        $levels = [];
        if(count($level_codes) > 0) {
            $levels = Level::find()->where(['level_code' => $level_codes])->all();

SELECT * FROM `riskstore` WHERE (`program_id`='6') AND (`status`=1)
---
    protected function GetRisk($id) {
        $datas = Riskstore::find()->where(['program_id' => $id,'status' => 1])->all(); // ดึงชื่อความเสี่ยงที่เปิดใช้งานอยู่

SELECT * FROM `risk` WHERE `id`='10317'
---
    public function actionSend($id) {

        if (Yii::$app->user->isGuest || Yii::$app->user->identity->role == 99 || Yii::$app->user->identity->role == 3) {
              return $this->redirect(['user/security/login']);
        }
        $user = Yii::$app->user->identity->username;
        $connection = Yii::$app->db;

        $model = Risk::find()->where(['id' => $id])->one();