frontend_old/controllers/RiskregisterController.php

SELECT * FROM `riskregister` WHERE ((`id`='10317') AND (`id_risk`='10317')) AND (`level_id` IN ('E', 'F', 'G', 'H', 'I', '3', '4', '5'))
---
    public function sendLine($model,$id, $id_risk){

	    $model = Riskregister::find()->where(['id' => $id,'id_risk' => $id_risk])
			->andWhere(['IN', 'level_id', ['E','F','G','H','I','3','4','5']])
			->one();

SELECT * FROM `riskregister` WHERE (`id`='10317') AND (`id_risk`='10317')
---
    protected function findModel($id, $id_risk)
    {
        if (($model = Riskregister::findOne(['id' => $id, 'id_risk' => $id_risk])) !== null) {

SELECT * FROM `riskstore` WHERE `program_id`=6
---
    protected function GetRisk($id) {
        $datas = Riskstore::find()->where(['program_id' => $id])->all();

SELECT * FROM `level` WHERE `level_id`='B'
---
      protected function GetLevel($id) {
        $datas = Level::find()->where(['level_id' => $id])->all();