frontend_old/models/Department.php

SELECT * FROM `department`
---
    public static function GetListName(){
        return ArrayHelper::map(self::find()->all(), 'id', 'depart_name');