frontend_old/views/riskregister/_form.php

        </div>

        <div class="col-md-2 col-xs-12">
            <?= $form->field($model, 'duration_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Duration::find()->all(),'id','duration_name'),
            'value' => $model->duration_id,
            'options' => ['placeholder' => 'เลือกเวร'],
            'disabled'=>true,
            'pluginOptions' => [
                'allowClear' => true
                ],
            ]);
---
SELECT * FROM `duration`

        </div>

        <div class="col-md-5 col-xs-12">
            <?= $form->field($model, 'location_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Location::find()->all(),'id','name'),
                'options' => ['placeholder' => 'เลือกสถานที่พบเหตุ'],
                'disabled'=>true,
                'pluginOptions' => [
                    'allowClear' => true
                    ],
                ]);
---
SELECT * FROM `location`

                <?= $form->field($model, 'user_ir_type')->label('ประเภทการรายงาน')->inline()->radioList(frontend\models\Riskregister::itemAlias('irtype')) ?>
            </div>
            <div class="col-md-4 col-xs-12">
                <?= $form->field($model, 'user_ir')->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Department::find()->all(),'id','depart_name'),
                    'disabled'=>true,
                    'options' => ['placeholder' => 'เลือกแผนกที่รายงานถึง'],
                    'pluginOptions' => [
                        'allowClear' => true
                        ],
                    ]);
                ?>
            </div>
            <div class="col-md-5 col-xs-12">
                <?= $form->field($model, 'program_id')->dropdownList(
                        ArrayHelper::map(Program::find()->all(), 'program_id', 'program_name'), [
                    'id' => 'ddl-programs',
                    'disabled'=>true,
                    'prompt' => 'เลือกโปรแกรม'
                        ]
                );
---
SELECT * FROM `department`
SELECT * FROM `program`

            ?>
        </div>
        <div class="col-md-12 col-xs-12"><font color="red"><label>* <u>หมายเหตุ</u> ระดับ A-I ใช้สำหรับความเสี่ยงทางคลินิก / ระดับ 1-5 ใช้สำหรับความเสี่ยงทั่วไป</label></font>
            <?= $form->field($model, 'level_id')->radioList(
                ArrayHelper::map(Level::find()->all(), 'level_code', 'level_name'), [
                    'prompt' => 'เลือกระดับความรุนแรง'
                ]
            );
---
SELECT * FROM `level`

<!-- row5 -->
 <div class="row">
        <div class="col-md-3 col-xs-12">
            <?= $form->field($model, 'inform_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Inform::find()->all(),'id','inform_name'),
                'disabled'=>true,
                'options' => ['placeholder' => 'เลือกที่มาของความเสี่ยง'],
                'pluginOptions' => [
                    'allowClear' => true
                    ],
                ]);
---
SELECT * FROM `inform`


          <div class="row">
              <div class="col-md-12 col-xs-12">
                  <?=
                  $form->field($model, 'repeat_code')->widget(Select2::classname(), [
                      'data' => ArrayHelper::map(Levelwarning::find()->all(), 'warning_code', 'warning_name'),
                      'options' => ['placeholder' => 'กรุณาเลือกระดับการทบทวน'],
                      'pluginOptions' => [
                          'allowClear' => true
                      ],
                  ]);
---
SELECT * FROM `levelwarning`

                </div>
          </div>

			  <?=
			  $form->field($model, 'sendto_department_id')->widget(Select2::classname(), [
				  'data' => ArrayHelper::map(Department::find()->all(), 'id', 'depart_name'),
				  'options' => ['placeholder' => 'เลือกหน่วยงาน'],
				  'pluginOptions' => [
					  'allowClear' => true
				  ],
			  ]);
			  ?>

			  <?=
			  $form->field($model, 'sendto_team_id')->widget(Select2::classname(), [
				  'data' => ArrayHelper::map(Team::find()->all(), 'id', 'team_name'),
				  'options' => ['placeholder' => 'กรุณาเลือกทีมนำ'],
				  'pluginOptions' => [
					  'allowClear' => true
				  ],
			  ]);
			  ?>

			  <?=
			  $form->field($model, 'sendto_member_cid')->widget(Select2::classname(), [
				  'data' => ArrayHelper::map(Member::find()->where(['priority' => 1])->all(), 'cid', 'member_name'), //  เลือกเฉพาะ pirority=1 ประธานบริหาร รพ. CEO
				  'options' => ['placeholder' => 'กรุณาเลือก CEO รพ.'],
				  'pluginOptions' => [
					  'allowClear' => true
				  ],
			  ]);
---
SELECT * FROM `department`
SELECT * FROM `team`
SELECT * FROM `member` WHERE `priority`=1