frontend_old/views/risk/_form.php

SELECT * FROM `duration`
---
        </div>

        <div class="col-sm-2 col-xs-12">
            <?= $form->field($model, 'duration_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Duration::find()->all(),'id','duration_name'),
            'value' => $model->duration_id,
            'options' => ['placeholder' => 'เลือกเวร'],
            'pluginOptions' => [
                'allowClear' => true
                ],
            ]);

SELECT * FROM `location`
---
        </div>

        <div class="col-sm-5 col-xs-12">
            <?= $form->field($model, 'location_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Location::find()->all(),'id','name'),
                'options' => ['placeholder' => 'เลือกสถานที่พบเหตุ'],
                'pluginOptions' => [
                    'allowClear' => true
                    ],
                ]);

SELECT * FROM `department`
SELECT * FROM `program` ORDER BY `program_name`
---
                <?= $form->field($model, 'user_ir_type')->label('ประเภทการรายงาน')->inline()->radioList(frontend\models\Risk::itemAlias('irtype')) ?>
            </div>
            <div class="col-sm-4 col-xs-12">
                <?= $form->field($model, 'user_ir')->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Department::find()->all(),'id','depart_name'),
                    'options' => ['placeholder' => 'เลือกแผนกที่รายงานถึง'],
                    'pluginOptions' => [
                        'allowClear' => true
                        ],
                    ]);
                ?>
            </div>
            <div class="col-sm-5 col-xs-12">
                <?= $form->field($model, 'program_id')->dropdownList(
						ArrayHelper::map(Program::find()->orderBy(['program_name'=>SORT_ASC])->all(), 'program_id', 'program_name'), [

                    'id' => 'ddl-programs',
                    'prompt' => 'เลือกโปรแกรม'
                        ]
                );

SELECT * FROM `inform`
---
<!-- row5 -->
 <div class="row">
        <div class="col-sm-3 col-xs-12">
            <?= $form->field($model, 'inform_id')->widget(Select2::classname(), [
                'data' => ArrayHelper::map(Inform::find()->all(),'id','inform_name'),
                'options' => ['placeholder' => 'เลือกที่มาของความเสี่ยง'],
                'pluginOptions' => [
                    'allowClear' => true
                    ],
                ]);